#!/usr/bin/perl
#die

use strict;
use LWP::UserAgent;
use HTTP::Request;
use HTTP::Cookies;
use Data::Dumper;
use HTML::LinkExtor;
use Fcntl qw( LOCK_EX LOCK_NB O_RDWR O_CREAT );

exit
  unless sysopen( PID, 'cron_ftp.pid', O_RDWR | O_CREAT )
      && flock( PID, LOCK_EX | LOCK_NB );
print PID "$$\n";

# use File::Pid;
# my $pidfile = File::Pid->new( { file => 'x0.pid', } );
# my $pid = $pidfile->running;
# die "Service already running: $pid\n" if $pid;
# $pidfile->write;

my $ua = LWP::UserAgent->new;

$ua->cookie_jar( HTTP::Cookies->new );

push @{ $ua->requests_redirectable }, 'POST';
$ua->agent(
'Mozilla/5.0 (Windows; U; Windows NT 5.1; ru; rv:1.9.1.2) Gecko/20090729 Firefox/3.5.2'
);

my $cookie_jar = HTTP::Cookies->new(
    file     => "cookis.txt",
    autosave => 1,
);

$ua->cookie_jar($cookie_jar);

my $acc = 'login:pass';
my ( $login, $pass ) = split( /:/, $acc );

my $content = $ua->get('http://www.mamba.ru/tips/?tip=login')->content();
my $s_post = $1 if $content =~ m#s_post=([0-9a-zA-Z]{32})#;

#sleep 17;

#print $s_post."\n";
#print $content;
#exit;

my $data = [
    's_post'   => $s_post,
    'tip'      => 'LOGIN',
    'goto'     => '',
    'login'    => $login,
    'password' => $pass
];

$ua->default_header( 'X-Requested-With' => "XMLHttpRequest" );
my $res =
  $ua->post( 'http://www.mamba.ru/ajax/login.phtml?XForm=Login', $data );
$ua->default_header( 'X-Requested-With' => "" );

my $d = h();

my @massages = ( $d =~ /<li>(.*)<\/li>/g );

#print $_."\n" for  @massages;
#exit;

#sleep 23;

#print  $res->content();
#exit;

# search string
# строка поиска
my $res4 = $ua->get(
'http://www.mamba.ru/search_ext.phtml?ext=1&t=a&sz=b&ia=M&lf=F&af=18&at=26&s_c=9908_10165_0_0&reply_rate=0&height_from=0&height_to=0&height_unit=cm&weight_from=0&weight_to=55&weight_unit=kg&constitution[Thin]=1&constitution[Sports]=1'
);

#sleep 15;

my $h;

my $c = $res4->content();

my $l = HTML::LinkExtor->new();

$l->parse($c);

my @link_page;
for ( $l->links ) {
    push @link_page, $_->[2]
      if ( $_->[2] =~ /height_unit/ && $_->[2] !~ /mamba/ );

}

#print Dumper \@link_page;
#exit;

#img src="http://193.0.171.30/65/41/98/1275891456/1275891859_medium.jpg?updated=20140604020558"

while ( $c =~ /\d+\/\d+\/\d+\/([0-9]{10})\//smg ) {

    $h->{$1}++;

}

#print Dumper \@link_page;
#exit;

my $res6 = $ua->get( 'http://www.mamba.ru/search_ext.phtml' . $link_page[-1] );

#print $res6->content();
#exit;

$c = $res6->content();

$l->parse($c);

for ( $l->links ) {
    push @link_page, $_->[2]
      if ( $_->[2] =~ /height_unit/ && $_->[2] !~ /mamba/ );

}

#print Dumper \@link_page;
#exit;

my $res7 = $ua->get( 'http://www.mamba.ru/search_ext.phtml' . $link_page[-1] );

#print $res6->content();
#exit;

$c = $res7->content();

$l->parse($c);

for ( $l->links ) {
    push @link_page, $_->[2]
      if ( $_->[2] =~ /height_unit/ && $_->[2] !~ /mamba/ );

}

for (@link_page) {

    my $res5 = $ua->get( 'http://www.mamba.ru/search_ext.phtml' . $_ );

    #sleep 17;
    #sleep 27;

    my $cc = $res5->content();

    while ( $cc =~ /\d+\/\d+\/\d+\/([0-9]{10})\//smg ) {

        $h->{$1}++;

    }

}

for ( open_black() ) {

    delete $h->{$_} if exists $h->{$_}

}

print Dumper $h;
print "\nCount all ankets prev:--" . scalar @{ [ keys %$h ] } . "--\n";

my @link_page_ex = ();

my $count_die = 0;

while (1) {
    $count_die++;

# > 180 - the number of questionnaires that gaining script from searching
# > 180 - число анкет, которые набирает скрипт из поиске
    last if ( scalar @{ [ keys %$h ] } ) > 180;

# $count_die > 150 - the number of parishes in the search depth profiles with insufficient.
# A large number of > 100 slow down the script for 5-10 hours
#
# $count_die > 150 - количество приходов в глубину поиска при недостаточном количестве анкет.
# Большое количество > 100 замедлит работу скрипта на 5-10 часов
    if ( $count_die > 150 ) {
        set_green("error");
        last;
    }

    print "looking for profiles...\n";

    my $res7 =
      $ua->get( 'http://www.mamba.ru/search_ext.phtml'
          . ( $link_page_ex[-1] || $link_page[-1] ) );

    $c = $res7->content();

    $l->parse($c);

    @link_page_ex = ();

    for ( $l->links ) {
        push @link_page_ex, $_->[2]
          if ( $_->[2] =~ /height_unit/ && $_->[2] !~ /mamba/ );

    }

    for (@link_page_ex) {

        my $res5 = $ua->get( 'http://www.mamba.ru/search_ext.phtml' . $_ );

        #sleep 17;
        sleep 27;

        my $cc = $res5->content();

        while ( $cc =~ /\d+\/\d+\/\d+\/([0-9]{10})\//smg ) {

            $h->{$1}++;

        }
    }

    for ( open_black() ) {
        delete $h->{$_} if exists $h->{$_};
    }

    for ( get_green() ) {
        delete $h->{$_} if exists $h->{$_};
    }

    print "\nCount all ankets finall ROW:--"
      . scalar @{ [ keys %$h ] } . "--\n";

}

print Dumper $h;
print "\nCount all ankets finall:--" . scalar @{ [ keys %$h ] } . "--\n";

my $count = 1;

my @result;
foreach ( keys %$h ) {

    my $res2 = $ua->get( 'http://www.mamba.ru/my/message.phtml?uid=' . $_ );

    sleep 42;

    print $_. "-" . $count . "\n";
    $count++;

    my $p3 = $res2->content;

    if ($p3 =~ /mb15\sfs15.+100.+\)\./ ) {
        print "100 LIMIT!\n";
        exit;
    }

    #Была в течение недели - 36
    #Была месяц назад - 26  - 29
    #Была сегодня в 04:38 29
    #Была вчера в 20:19 - 25
    #Была неделю назад - 30
    #Была в течение месяца - 36

    my $real = ( $p3 =~ /realuser\.phtml/g ) ? 1 : 0;

    my $st =
      ( $p3 =~
/status\s\">(.*)<\/span>\s+<\/div>\s+<\/div>\s+<a\sclass=\"username\"/smg
      )[0]
      || 0;

    $st =~ s/\s//g;

    next if ( $p3 =~ /class=\"m\"/ );

    print $real. "--" . length $st . "\n";

    if ( $p3 =~ /data-timestamp="\d+"/ ) {

        open( my $fh, ">>", 'black.txt' );
        print $fh "$_\n";
        close $fh;

        next

    }

    if ( ( ( !$real ) && ( ( length $st ) ~~ [qw/26 29 28/] ) ) ) {
        print "UNREAL LAST MOUTH's\n";
        set_green($_);
        next;
    }

    if ( $real && ( length($st) ~~ [qw/26 29 28/] ) ) {
        print "REAL LAST MOUTH's\n";
        set_green($_);
        next;
    }

    if ( !$real && ( length($st) ~~ [qw/36 29 28 26 30/] ) ) {
        print "UNREAL LAST ALL\n";
        set_green($_);
        next;
    }


#   if (!$real) {
#       print "UNREAL!!\n";
#       set_green($_);
#       next
#   }


## remove
# only for profiles that have been today or yesterday, for real or not real
# (только для анкет которые были сегодня или вчера, для реальных или для не реальных)
##
    # START
##
    #if ( ((length ($st)) ~~ [ qw/36 26 30 28 29/ ] ) ) {
    #print "LAST2 ALL\n";
    #set_green($_);
    #next
    #}
##
    # END
##

    my $res3 = $ua->post(
        "http://mamba.ru/my/message.phtml",
        [
            's_post'  => $s_post,
            'action'  => 'post',
            'uid'     => $_,
            'message' => $massages[ rand( $#massages + 1 ) ],
            'send'    => 1
        ]
    );

    sleep 43;

}

sub open_black {

    open( MYFILE, 'black.txt' );

    my @black = <MYFILE>;
    chomp(@black);
    close MYFILE;

    return @black;

}

sub get_green {

    open( MYFILE, 'green.txt' );

    my @black = <MYFILE>;
    chomp(@black);
    close MYFILE;

    return @black;

}

sub set_green {
    my ($id) = @_;
    open( my $fh, ">>", 'green.txt' );
    print $fh "$id\n";
    close $fh;
}

sub h {

    my $html = <<'EOF';

<li>А Вам случалось знакомиться с интересным молодым человеком возле метро?</li>
<li>А Вы не встречали меня в Сочи в 2000 году? Нет. А почему Вам тогда кажется, что мы с Вами давным-давно знакомы?.. А почему тогда Вы кидаете на меня такие призывные и полные страсти взгляды?..<span id="more-192"></span> Зачем тогда Вы ко мне пристали, даже не взглянув?.. Наверное, желаете дать телефончик?</li>
<li>А Вы не встречали меня в Сочи в 2000 году? Нет? И не мудрено - ведь меня там не было. А где Вы меня встречали, не подскажете?</li>
<li>А какой сейчас курс испанской песеты? А португальского эскудо?</li>
<li>А не с Вами я сегодня по телефону разговаривал?</li>
<li>А у Вас, случайно, не моя книга?.. Нет? Да вот давал кому-то на почитать, а кому... Помню только, что кто-то очень симпатичный!</li>
<li>А что Вы будете делать сегодня вечером, после того как мы с Вами сходим в кино?</li>
<li>А что Вы делаете всю оставшуюся жизнь?</li>
<li>Боржоми о колбасу я уже купил. Так что мы можем устроить свидание прямо здесь и сейчас.</li>
<li>Будьте моей прекрасной дамой, а я буду Вашим рыцарем. Кто сказал, что рыцари перевелись? Постучите по моей голове. Слышите? Звук такой, как будто Вы стучите по железному шлему.</li>
<li>Вам исключительно идет Ваш парик!</li>
<li>Ваше платье классно на Вас смотрится, но лучше оно будет смотреться на полу моей спальни.</li>
<li>Вашей маме нужен зять?.. Ну, что делать? Тогда давайте расписываться пока не будем, а так поживем.</li>
<li>Ваши волшебные глаза свели меня с ума, и если в ближайшее время мы не увидимся, мое сердце разорвется.</li>
<li>Ваши документы!</li>
<li>Видишь ту яркую точку на ночном небе? Это комета, которая летит прямо сюда со скоростью 35000 километров в секунду. По расчетам, она будет здесь через час. Итак, хочешь заняться сексом?</li>
<li>Возможно, я здесь не самый лучший, но единственный, кто разговаривает с тобой.</li>
<li>Вот тебя-то я и искал!</li>
<li>Время не подскажете?.. А свободного?</li>
<li>Вы - Наташа, моя связная?</li>
<li>Вы арестовали меня своей красотой, и я был бы счастлив отбывать пожизненное наказание в плену Вашего сердца.</li>
<li>Вы виноваты - Вы и расхлебывайте!.. ?.. В том, что обладаете таким завораживающим взглядом, который на упитанного в меру холостого мужчину в самом расцвете сил действует сильнее оружия массового поражения.</li>
<li>Вы говорите по-русски?</li>
<li>Вы заблудились! Я могу Вам помочь?</li>
<li>Вы знаете, ужасно приятно увидеть хоть одну девушку, которая идет медленно. В наше время все так бегут... У нас в городе скоро будет как в древних племенах: догнал - значит, женился, не догнал - сам виноват. Вы знаете такой обычай?</li>
<li>Вы знаете, чем хороша сковорода? Тем, что ею можно огреть по голове того, кто сильно надоел, а поскольку у Вас сейчас нет этой ценной посуды, я решился узнать, как Вас зовут, и попросить телефончик.</li>
<li>Вы знаете, чем эта улица (площадь, станция, вагон) отличается от всех других?.. Тем, что мы с Вами встретились именно на ней.</li>
<li>Вы знаете, что такое любовь с первого взгляда, или мне еще раз пройти?</li>
<li>Вы из какой сказки?</li>
<li>Вы когда-нибудь бывали в Париже? А на Таити? Хотите побывать? Я через десять лет собираюсь поехать, могу взять Вас с собой.</li>
<li>Вы красивы как звезда! Только звезды красивы ночью, а Вы прекрасны и днем.</li>
<li>Вы мне не подскажете?</li>
<li>Вы мне так понравились, что я иду за Вами уже три остановки. Вы не возражаете, если мы присядем и немного отдохнем?</li>
<li>Вы на барабанах играете?.. Я тоже! Смотрите сколько у нас общего, давайте познакомимся.</li>
<li>Вы на всех так смотрите, или только на тех, кто понравился?</li>
<li>Вы напоминаете мне мою двоюродную сестру. Я также сильно хочу трахнуть ее, но понимаю, что этого нельзя делать.</li>
<li>Вы напоминаете мою покойную девушку.</li>
<li>Вы не боитесь, что кто-нибудь вот так с Вами познакомится?</li>
<li>Вы не видели случайно - тут пять минут назад мой белый конь не пробегал?</li>
<li>Вы не возражаете, если я скроюсь от палящего солнца в тени Вашей стройной фигуры?</li>
<li>Вы не знаете, как лучше истратить мою зарплату?</li>
<li>Вы не могли бы меня разбудить завтра утром звонком на сотовый телефон, а то я боюсь проспать.</li>
<li>Вы не очень торопитесь? Я так хочу угостить Вас мороженым!</li>
<li>Вы не ошиблись - я иду прямо к Вам.</li>
<li>Вы не переведете меня на другую сторону?</li>
<li>Вы не подскажете - который год?</li>
<li>Вы не подскажете - почему самолеты летают, а крыльями не машут?</li>
<li>Вы не подскажете - с какой стороны прикуривается сигарета?</li>
<li>Вы не подскажете мне рецепт кактусового варенья?</li>
<li>Вы не пригласите меня в ресторан?</li>
<li>Вы понимаете, у меня такие проблемы... Как только вижу девушку, так сразу хочется обнять ее, прижать к груди, целовать ее тело, а потом заниматься с ней любовью всю ночь. Просто нестерпимо хочется. И ничего не могу с этим поделать... Может, вы мне можете что-то предложить?</li>
<li>Вы просто прелестны! Я не могу пройти мимо и не сделать Вам этот комплимент, а познакомиться просто физически не хватает времени, так как я очень опаздываю. Может быть, Вы дадите мне свой номер телефона? Я Вам позвоню, и мы познакомимся по всем правилам.</li>
<li>Вы разменяете Ваше уединение и однообразное существование на романтические прогулки под луной вдвоем и веселый смех?</li>
<li>Вы разменяете мое свободное время на Ваши имя и телефончик?</li>
<li>Вы разменяете мои скуку и одиночество на озорной блеск Ваших глаз?</li>
<li>Вы случайно не английская королева? У Вас просто королевская походка!</li>
<li>Вы так интеллектуально выглядите в очках, что я даже не знаю, смогу ли Вас заинтересовать.</li>
<li>Вы так красиво улыбнулись, что я забыл куда шел.</li>
<li>Вы такая грустная... Можно я заберу Вашу грусть? Она мне нужна для экспериментов.</li>
<li>Вы такая красивая, Вам телохранитель нужен?.. Я умею с двух рук стрелять и в банку с 20 шагов попадаю... C десяти метров попадаю в глаз бегущему таракану... Могу табуреткой вертолет сбить, если грамотно метнуть... Зубами пулю на лету ловлю... У меня черный пояс... по шахматам. Меня Андрей зовут, что означает "мужественный"... А что это мы все обо мне и обо мне... Давайте о Вас поговорим. Как Вас зовут?</li>
<li>Вы что, думаете, что можете смотреть на меня как на сексуальный объект, и Вам это сойдет с рук?</li>
<li>Вы что, за мной следите?! Я вас видел уже пару сотен раз, что Вы от меня хотите? Вы мне уже полгода снитесь по ночам, а я не знаю, как Вас называть во сне! Может, Вы, наконец, скажете мне свое имя? Тогда я смогу с Вами разговаривать, пусть хоть во сне!</li>
<li>Вы, должно быть, устали... Всю ночь бегали за мной во сне.</li>
<li>Вы, наверное, полжизни потратили на то, чтобы хорошо выглядеть и привлекать мужчин... И вот, я на это попался!</li>
<li>Вызовите "скорую"! Меня только что Амур подстрелил.</li>
<li>Выходите за меня замуж, а то я передумаю.</li>
<li>Голоса свыше сказали мне, чтобы я подошел и поговорил с Вами.</li>
<li>Гороскоп обещал мне знакомство с колдуньей. Очевидно, оно уже состоялось.</li>
<li>Давайте не будем знакомиться, пройдем мимо друг друга и Вы не узнаете, что меня зовут Руслан, а я не узнаю, как зовут Вас. Вы потеряете меня, такого доброго, веселого, красивого, а я потеряю неповторимо-божественную Вас. И мы не сможем провести минуты, часы вместе, а дни, проведенные вместе, будут казаться для нас лишь секундами. Вы согласны?</li>
<li>Давайте поиграем в весы! Вы сядете мне на лицо, а я угадаю Ваш вес.</li>
<li>Давайте поиграем в интересную игру. Я Вам скажу свое имя, Вы мне свое, а потом мы, взявшись за ручки, пойдем лопать мороженое в ближайшей кафешке.</li>
<li>Давайте поспорим с Вами на 100$, что я Вас сейчас приглашу переночевать, а Вы откажетесь?</li>
<li>Девушка, Вы очень красивы, а красивых девушек надо размножать.</li>
<li>Добрый день, у меня к Вам совершенно нетрадиционный вопрос. Меня интересует, как бы Вы отказали молодому человеку, который подошел бы к Вам и сказал: "Давайте познакомимся"?</li>
<li>Должно быть, это больно... падать с небес.</li>
<li>Друзья зовут меня Андреем, но ты можешь позвать меня завтра.</li>
<li>Если Бог и создал что-то красивее Вас, то он оставил это для себя.</li>
<li>Если бы звезды падали каждый раз, как я думаю о Вас, небо было бы черным, ночь стала бы мрачной.</li>
<li>Если Вам отрубить руки, Вы станете похожей на Венеру Милосскую.</li>
<li>Если вы думаете, что я собираюсь с Вами познакомиться, то Вы ошибаетесь - я еще и на свидание хочу Вас пригласить!</li>
<li>Здесь действительно жарко, или это Вы такая горячая?</li>
<li>Здесь местность заминирована. Пойдемте, покажу обходной путь!</li>
<li>Здравствуйте! Завтра?.. Как что? Завтра встречаемся здесь же в 8 вечера?.. Не хотите? ОК, значит завтра в восемь в другом месте?.. Не так? Значит, все же здесь?.. Вот и договорились!</li>
<li>Здравствуйте! Я делаю перепись населения, и решил начать с Вас.</li>
<li>Здравствуйте! Я заблудился в жизни и ищу красивую, умную, добрую, как Вы, девушку, которая выведет меня из этого скучного, тусклого мира одиночества.</li>
<li>Знаете, Ваши волосы так гармонируют по цвету с моей подушкой.</li>
<li>Знаете, я смотрю на Вас и думаю, как мои будущие дети будут спрашивать: "Папа! Папа! Как ты познакомился с мамой?" И я буду вспоминать это прекрасную минуту, когда я увидел Вас.</li>
<li>Знаешь, весна пришла - пора размножаться. Да и для здоровья полезно. Пошли ко мне.</li>
<li>И каково же чувствовать себя самой прекрасной девушкой в этом городе?</li>
<li>Идем на свидание!</li>
<li>Иди к дяде, пока я тебе уши не намылил.</li>
<li>Извините, Вы можете меня посчитать полоумным, но боюсь, что если не услышу Ваш голос, то никогда не прощу себе этого. Вы затронули все мои мысли и мне страшно, что я не смогу от этого избавиться. Сон потеряет для меня всякий смысл, ибо он будет с большой радостью заменен написанием сонетов и стихов Вам. Будет очень жаль, если они пропадут даром, и Вы не сможете их прочитать. Готовы ли Вы пожертвовать жизнью бедного влюбленного поэта?</li>
<li>Извините, я Вам нравлюсь?.. Не отвечайте, меня Романом зовут. А Вас как зовут? Давайте я Вам позвоню как-нибудь. У Вас есть телефон?</li>
<li>Извините, я забыл свой номер телефона. Вы свой не одолжите?</li>
<li>К сожалению, сейчас у меня нет времени растопить Ваш холодный взгляд, но я могу позвонить Вам вечером.</li>
<li>Кажется, нам по пути...</li>
<li>Кажется, сегодня была радуга... Мои желания сбываются.</li>
<li>Как Вам здесь нравится?</li>
<li>Как Вы считаете, что должен сказать интересный молодой человек симпатичной девушке при знакомстве на улице, чтобы не получить отказ?</li>
<li>Какое блюдо я лучше всего готовлю? Завтрак в постель.</li>
<li>Какой у Вас размер обуви?.. Ну вот и познакомились!</li>
<li>Классные ножки! В котором часу они открываются?</li>
<li>Классные туфельки! Трахаться хочешь?</li>
<li>Когда я вижу такую девушку, как Вы, я благодарю Господа за то, что я не женат.</li>
<li>Когда я гляжу на Вас, мое сердце замирает! Вызовите скорую кардиологическую помощь.</li>
<li>Коснись ее блузки и спроси: "Это хлопок?" Затем коснись ее в области промежности и продолжи: "О, а это, должно быть, фетр".</li>
<li>Красная Шапочка, я тебя съем!</li>
<li>Кто же это может опаздывать к такой красивой девушке? Я, например, уже здесь!</li>
<li>Кто такая? Почему не знаю?</li>
<li>Куда бы Вы пошли, если бы хотели найти себе нового приятеля?</li>
<li>Куда Вы? Я только решился к Вам подойти, а Вы уже уходите. Спешите? Давайте я Вас провожу. Меня, кстати, Мишей зовут, а Вас?</li>
<li>Меня зовут Андрей, и мне поручено передать Вам привет... От кого? От моего сердца.</li>
<li>Меня-то зовут Андрей, а вот Вы-то кто?</li>
<li>Мне в жизни не хватает двух вещей - волос и тебя.</li>
<li>Мне говорили, что целовать курящую девушку все равно, что облизывать пепельницу. Что Вы на это можете сказать?</li>
<li>Мне до Чукотки еще далеко? А то бабушку хочу проведать.</li>
<li>Мне жалко окружающих. Ваша красота делает их серой массой.</li>
<li>Мне интересно, насколько Ваше содержание соответствует Вашим формам.</li>
<li>Мне кажется, наши пути пересеклись не случайно...</li>
<li>Мне кажется, что мы с Вами родственники. Позвольте взглянуть на фамильную родинку на груди.</li>
<li>Мне нравится Ваша шляпка!.. Мне нравятся Ваши часы!.. Если хорошо подумать, мне в вас все нравится!.. Меня зовут Иван. Каким именем зоветесь Вы, блестящий образец природного совершенства?</li>
<li>Мне цыганка нагадала, что сегодня я встречу красавицу в красном платье. Вам это описание никого не напоминает?</li>
<li>Могу поклясться, Вам не помешало бы сопровождение какого-нибудь бездамного на данную минуту рыцаря. На Ваше счастье я как раз тут и без дамы... пока что.</li>
<li>[Многие из этих начальных фраз знакомства, которые любят использовать люди с ограниченной фантазией, были когда-то изобретены экспромтом людьми с фантазией при общении с незнакомкой. Если вы хотите развить свою способность к импровизации и действовать по ситуации, особенно при знакомстве и соблазнении, вы можете научиться этому в реальных условиях на практических пикап тренингах Академии Знакомств под контролем спецоборудования в "горячем режиме".]</li>
<li>Могу я с Вами пофлиртовать?</li>
<li>Может поедем ко мне, задернем шторы, разденемся, ляжем в постель, укроемся одеялом и посмотрим: что из этого получится?</li>
<li>Можно Вам привет передать?</li>
<li>Можно Вас поцеловать в губы? Я хочу преодолеть в себе комплекс брезгливости!</li>
<li>Можно Вас спросить?.. Что бы Вас спросить?</li>
<li>Можно мне взять Вашу фотографию?.. Я собираю "покемонов".</li>
<li>Можно мне с Вами пройтись? А то ко мне всякие пристают, документы спрашивают.</li>
<li>Можно сфотографировать Вас возле статуи? Тогда снимок получится более живым.</li>
<li>Можно у тебя фотографию взять? Я хочу, чтобы Дед Мороз не ошибся подарком на Новый Год.</li>
<li>Можно узнать Ваше имя? Я хочу представить его со своей фамилией.</li>
<li>Можно я за Вас подержусь, а то от Вашей красоты у меня ноги подкашиваются!</li>
<li>Можно, я встречу Новый Год с Вами?</li>
<li>Молоко и шоколад, инь и янь, черное и белое, день и ночь, ты и я.</li>
<li>Мой галстук не съехал в сторону? Я иду на важную встречу и хочу выглядеть безупречно.</li>
<li>Моя любовь к тебе как диарея - я не могу ее сдерживать.</li>
<li>Моя мечта - поцелуй ангела...</li>
<li>Моя просьба может показаться Вам безумной, но я только что купил лотерейный билет и хочу, чтобы Вы поцеловали его и принесли мне удачу.</li>
<li>Не знаю, кто Вы такая и как Вас зовут, но я хочу увидеть Вас еще раз.</li>
<li>Не отвечайте на звонок. Это меня.</li>
<li>Не откажите себе в удовольствии мило поболтать с молодым человеком, которому Вы очень симпатичны, пока я Вас провожаю до того места, куда Вам необходимо.</li>
<li>Не откажите себе в удовольствии утреннего кофе в моей компании.</li>
<li>Не подскажете, где находится нофелет?</li>
<li>Немцы в городе есть? А русские?</li>
<li>Неужели у такой красивой девушки, как Вы, сегодня нет кавалера?</li>
<li>Ничего, что я к тебе с таким умным видом?</li>
<li>О, Боже! Я думал, что я гей, пока не встретил тебя!</li>
<li>Обещаю, что не буду дышать ночами в трубку</li>
<li>Ой, а что у Вас за классные духи, и где их купить?</li>
<li>Перила - это, конечно, хорошо, но моя мужественная рука для опоры гораздо надежней.</li>
<li>Поговорим, или будем продолжать перемигиваться?</li>
<li>Подскажите, пожалуйста, где именно Вы хотите поставить свой автограф - в этом блокноте или на этой симпатичной открытке?</li>
<li>Пойдемте в лес - город покажу.</li>
<li>Пойдемте в огород - я покажу мои большие твердые огурцы.</li>
<li>Помнишь меня? Мы с тобой встречались в твоих снах. Правда, тогда я был в шлеме и на белом коне.</li>
<li>Помогите бездомному, возьмите к себе домой.</li>
<li>Помогите мне купить пива! Я не знаю - какое выбрать?</li>
<li>Помогите мне сходить налево!</li>
<li>По-моему, и Вам, и мне в этой толпе скучно. Может быть, нам уйти куда-нибудь?</li>
<li>Послушайте... Я бы мог придумать какой-то предлог для знакомства, но не хочу морочить Вам голову. Мы можем обойтись без формальностей?</li>
<li>Постойте спокойно хотя бы минутку. Я Вас рисую.</li>
<li>Потрогайте мой лоб. Кажется, у меня температура.</li>
<li>Поцелуй меня, если я ошибаюсь, но кажется, тебя зовут Агрипина.</li>
<li>Правда! Закат выглядит очень романтично, правда?</li>
<li>Привет! А почему ты мне не звонила, не писала? Ведь знаешь как грустно осознавать то, что ты никому не нужен.</li>
<li>Привет! А ты чего тут делаешь?.. Стоишь? Замечательно! Давай стоять вместе!</li>
<li>Привет! Давай я буду звать тебя "Фекла", а ты меня - "Мистер Мокрые Штаны"!</li>
<li>Привет! Знаешь (понимаешь, чувствуешь, видишь...), что сегодня Солнышко светит (греет, сыплет лучами, радуется...) и на улице стоит приятная (классная, сказочная...) погода. Мы могли бы прогуляться, поговорить, поесть мороженого (попить джина...) и очень весело (классно, мило, приятно...) провести время. Это было бы не забываемо. Кстати, когда я тебя видел в прошлый раз, ты была в потрясном платье (юбке, костюме), что не пригласить тебя на легкую прогулку было бы преступлением. И твой твое согласие станет оправдательным приговором мне, милому парню!</li>
<li>Привет! Как дела?</li>
<li>Привет! Сегодня нам везет...</li>
<li>Привет! Узнала?.. Вот я тебя тоже не сразу узнал.</li>
<li>Привет, солнышко! Меня зовут Тарзан. Я тут кокосы собирал, и вдруг вижу - стоит одинокая девушка, которую зовут...</li>
<li>Приходи - почитаешь мне про Буратино.</li>
<li>Пройди мимо нее, потом резко обернись и спроси: "Это не Вы только что ущипнули меня за зад?.. Нет?.. Черт! Жаль..."</li>
<li>Простите меня, это видимо судьба. Мы уже второй раз сталкиваемся в таком огромном городе... Меня зовут Андрей. Как бы Вы отнеслись к предложению приятно провести вдвоем время у воды на газончике, с хорошим шампанским?</li>
<li>Простите, Вы не подскажите мне... Ваше имя и номер телефона.</li>
<li>Простите, мисс, у Вас огоньку не найдется?.. Вообще-то я не курю, но должен же я был как-то начать знакомство с Вами.</li>
<li>Простите, я Вас раньше не трахал?</li>
<li>Простите, я могу втереться в Ваше вечернее расписание?</li>
<li>Простите... Я просто хочу сказать Вам спасибо!.. У Вас когда-нибудь был такой день, когда Вы чувствовали себя отчужденной, равнодушной? Когда вы не совсем счастливы, и не... когда Вы чувствуете, что плывете по течению. И вдруг Вы сталкиваетесь с кем-то и видите удивительно теплую и прекрасную улыбку, которая вселяет в Вас чувство счастья, сказки, чувство прекрасного на целый день?.. Понимаете, я вовсе не хотел Вас отвлекать, но Вы выглядите так, что украсили своим появлением мою жизнь...</li>
<li>Рад милой барышне служить! Нельзя ли мне Вас проводить?</li>
<li>Разрешите предложить Вам руку и сердце. Я хирург, у меня этого добра навалом.</li>
<li>Разрешите проводить Вас до дома. Хотя бы взглядом.</li>
<li>С Вами можно познакомиться или так - пять минут поприставать?</li>
<li>С Вами сложно познакомиться?</li>
<li>С самого утра я опоздал в на работу, днем меня чуть не сбила машина, потом меня покусала злая собака, накричал бородатый дворник, я упал в канализационный люк и потерял там кошелек с документами, но и это еще не все - мой пейджер сгорел от удара молнией, тамагочи умер от передозировки, а час назад злобный вирус стер с моего компьютера книгу, над которой я работаю уже полгода. И если вы сейчас не дадите мне свой телефончик, чтобы я мог позвонить вам и пригласить на чашечку кофе, то пойду я наверное топиться вон в той луже на другой стороне улице. Учтите, у вас есть шанс спасти хорошего человека!</li>
<li>Скажите мне что-нибудь сладкое!</li>
<li>Скажите честно, мне идут эти контактные линзы?</li>
<li>Скажите, пожалуйста, какими духами Вы пользуетесь - я куплю такие же и надушу ими свою кошку, чтобы она напоминала мне о Вас.</li>
<li>Скажите, это не у вас из сумочки так вкусно пирожками пахнет?</li>
<li>Сколько стоит ваша улыбка? Я бы купил такую!</li>
<li>Спасайте! Меня преследует американский шпион, который охотится за этой запиской. Пожалуйста, возьмите ее и хорошо спрячьте, но ни в коем случае не читайте! Скажите мне ваш телефончик, чтобы я мог забрать ее обратно, когда все немного утихнет. (В записке "Улыбнись, тебя снимает скрытая камера!")</li>
<li>Стреляя глазками, не бросайте раненных!</li>
<li>Судьба Родины зависит только от Вашего решения! Соберите всю волю в кулак и скажите, познакомитесь Вы со мной или нет?</li>
<li>Тут у меня парочки зубов нет - зато больше места для твоего языка.</li>
<li>Ты в бутылочку играть умеешь? Давай вдвоем!</li>
<li>Ты в списке моих сегодняшних дел на вечер.</li>
<li>Ты знаешь, после долгих поисков я все-таки нашел кафе, где мы с тобой можем замечательно провести время.</li>
<li>Ты купила картошки? Так я и думал! Ну хорошо, тогда картошку покупаю я. Сегодня я жду тебя в гости на ужин. Все уже куплено, осталась только картошка. Но это ничего. Я все приготовлю. Ты во сколько сможешь прийти?.. Ах да, я забыл тебе сказать свой адрес! Записывай.</li>
<li>Ты не гей? Я тоже! Тогда можно и переспать.</li>
<li>Ты не могла бы улыбнуться: А то на улице темно.</li>
<li>Ты поцелуешь меня или мне снова придется врать в своем дневнике?</li>
<li>Ты сегодня была плохой, очень плохой девочкой. Мне придется тебя наказать...</li>
<li>Ты случайно интерьерами не занимаешься? Комната стала прекрасной, как только ты в нее вошла.</li>
<li>Ты столько времени у меня в мыслях проводишь, что скоро придется брать плату за аренду.</li>
<li>Ты так красива, что я забыл фразу, с которой хотел подойти к тебе.</li>
<li>Ты такая классная, что я готов выпить после тебя воду из ванной!</li>
<li>Ты хочешь пива или тебе просто денег дать?</li>
<li>Тысячи художником за тысячу лет не смогли создать такой красоты, которая могла бы спорить с твоей.</li>
<li>У Вас жетончика на такси не будет?</li>
<li>У Вас не будет консервного ключа?</li>
<li>У Вас не будет листка бумаги и ручки?.. А можно, я запишу Вам свой телефон? Мне бы не хотелось Вас терять.</li>
<li>У Вас нет аспирина?</li>
<li>У Вас ниточки не найдется, чтобы прямо здесь завязать нашу дружбу?</li>
<li>У Вас очень приятный голос! Я бы с удовольствием записал его на микрочип и поместил внутрь своего будильника, чтобы просыпаться под него каждое утро.</li>
<li>У Вас правый глаз светлее левого - никогда в жизни такое не встречал!</li>
<li>У Вас самое красивое место запачкалось.</li>
<li>У меня амнезия - я к вам еще не подходил?</li>
<li>У меня в штанах вечеринка, и ты приглашена.</li>
<li>У меня есть жених для вашей собачки. А может, и для вас.</li>
<li>У меня к Вам необычный вопрос - что нужно сказать девушке, чтобы получить пощечину?..</li>
<li>У меня к Вам просьба: можно, я подарю Вам этот цветок? Я бы хотел увидеть Вас когда-нибудь еще и подарить большой букет роз. Вы любите розы?</li>
<li>У меня руки заняты. Вы не застегнете мне ширинку?</li>
<li>У меня сегодня два праздника! Первый - я увидел такую чудесную, красивую девушку, у которой такой теплый и душевный взгляд. А второй - я с Вами заговорил.</li>
<li>У меня что-то с глазами - я не могу оторвать их от Вас.</li>
<li>У тебя есть парень? А нужен парень получше? Ответь сначала на второй вопрос.</li>
<li>Увидев Вас, я подумал о тех днях, которые буду вспоминать в старости - когда родились мои дети, когда я женился и когда я встретил Вас.</li>
<li>Фраза "Вы танцуете" там, где танцев и в помине нет.</li>
<li>Хотите пикапера?.. Это я, собственно, а что это слово означает - так в двух словах и не скажешь. Пойдемте, на лавочку присядем, я объясню... Нет времени? Ничего, давайте телефон, я Вас найду.</li>
<li>Хотите, я Вас прокачу с ветерком на эскалаторе?</li>
<li>Хочешь увидеть ступни своих ног в зеркале заднего виде моей машины?</li>
<li>Чем занимаешься в три часа ночи?</li>
<li>Что Вы на меня смотрите так, как-будто у Вас родители на дачу уехали?</li>
<li>Что же такая красивая девушка делает на этом эскалаторе/лифте?</li>
<li>Что же это Вы плететесь, как грустная черепаха, можно ли вам чем-нибудь помочь?</li>
<li>Это было сложно, но все же я решил подойти к Вам ногами и заговорить языком.</li>
<li>Это невероятно! Все 27 моих личностей нашли Вас удивительно привлекательной!</li>
<li>Это платье на Вас выглядит великолепно. Ну, вообще-то и я бы на его месте выглядел не хуже.</li>
<li>Эх, хороша Маша! Да не наша.</li>
<li>Я - заслуженный тормоз, я не знаю, как клеить девушек, но мимо Вас я просто не мог пройти, поэтому я надеюсь, что вы уделите жалкие три минуты для общения со мной. Можно, я Вас провожу, ну хоть немножко?</li>
<li>Я - продавец счастья. Хотите, Вам продам по себестоимости?</li>
<li>Я баллотируюсь в президенты в 2024 году. Мне важен твой голос. И мне нужен твой номер, чтобы рассказать тебе...</li>
<li>Я буду спать с тобой, с тобой и с тобой! Кто первый?</li>
<li>Я в городе первый раз. Можете показать, где Вы живете?</li>
<li>Я готов положить все, что имею, к Вашим ногам. Дайте мне Ваш адрес, и я завтра же перевезу к Вам мои вещи.</li>
<li>Я думаю о тебе два раза в день - когда мои глаза открыты и когда они закрыты.</li>
<li>Я думаю о тебе, когда мастурбирую.</li>
<li>Я думаю, что мы думаем об одном и том же.</li>
<li>Я заметил, что Вы меня заметили, и я хотел бы заметить, что Вас я заметил тоже.</li>
<li>Я иду в постель - ты со мной?</li>
<li>Я иду отливать - присоединишься?</li>
<li>Я интеллигентный молодой человек, 25/180/79, Весы, Кролик, увлекаюсь классической музыкой и йогой, хочу познакомиться с Вами для совместного приятного времяпрепровождения на своей территории, телефон ускорит встречу.</li>
<li>Я к стоматологу собираюсь, но смелости не хватает. Вдохновите меня, пожалуйста, станьте моей музой.</li>
<li>Я коллекционирую надписи на футболках. Разрешите прочесть на Вашей.</li>
<li>Я не пьян, я опьянен тобой.</li>
<li>Я ослеплен от света Вашей красоты</li>
<li>Я пишу книгу о том, как знакомиться с девушками, и хотел бы задать Вам несколько вопросов.</li>
<li>Я понимаю, что улица - не самое лучшее место для знакомства, но я себе никогда не прощу, если я хотя бы не попытаюсь с Вами познакомиться. Может Вы поймете такого хорошего, хоть и застенчивого молодого человека и не сразу пошлете в пешее эротическое путешествие...</li>
<li>Я правильно иду?</li>
<li>Я сегодня не смогу заснуть, если не узнаю Ваше имя и телефон.</li>
<li>Я скромно к Вам имею обратиться честь. Для скромного меня у Вас минутка есть?</li>
<li>Я слишком занят, зарабатывая миллионы долларов, но пару минут на знакомство найдется.</li>
<li>Я слышал, что с кем поведешься, от того и наберешься. Вы мне так понравились, что я решил набраться у Вас.</li>
<li>Я со своим другом поспорил о том, смогу ли я узнать Ваше имя и телефон. Помогите мне выиграть, пожалуйста.</li>
<li>Я со своим другом чуть не поссорился из-за Вас. Он говорит, что Вы красивая, а я с ним не согласен и говорю что Вы очень красивая. Кто из нас не прав?</li>
<li>Я собираю подписи самых красивых девушек. Не откажетесь поставить свою?</li>
<li>Я спрятал свою слезу в океане для тебя. И я буду любить тебя, пока ты ее не найдешь.</li>
<li>Я тут проверил свое расписание - я могу сделать тебя беременной к Рождеству.</li>
<li>Я уже здесь. Так что у тебя осталось только два желания.</li>
<li>Я хотел бы быть твоей слезой. Родиться в твоих глазах, струиться по твоей щеке и умереть на твоих губах.</li>
<li>Я хочу быть новогодней елкой у тебя дома.</li>
<li>Я хочу быть снежинкой, которая растает в твоих божественных волосах</li>
<li>Я хочу пригласить Вас на чашечку кофе (на мороженое, шашлык, кукурузные палочки) с серьезными намерениями!</li>

EOF

    #my $html2 = Encode::decode( 'utf8', $html);

    return $html;
}
